# Analyse des csv pour planifier la base de données

## Fichiers CSV
- activity.csv
- address.csv
- branch.csv
- code.csv
- contact.csv
- denomination.csv
- enterprise.csv
- establishment.csv

In [1]:
# Importer les librairies necessaires
import pandas as pd
import numpy as np

### activity.csv

In [2]:
#Chargez les fichiers csv dans des dataframes
activity = pd.read_csv('../data/activity.csv')

In [3]:
activity.head()

   EntityNumber  ActivityGroup  NaceVersion  NaceCode Classification
0  0200.065.765              6         2008     84130           MAIN
1  0200.065.765              1         2008     41101           MAIN
2  0200.065.765              1         2003     70111           MAIN
3  0200.068.636              6         2008     36000           MAIN
4  0200.068.636              1         2008     36000           MAIN

In [4]:
activity.shape

(20443184, 5)

In [5]:
activity.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20443184 entries, 0 to 20443183
Data columns (total 5 columns):
 #   Column          Dtype
---  ------          -----
 0   EntityNumber    object
 1   ActivityGroup   int64
 2   NaceVersion     int64
 3   NaceCode        int64
 4   Classification  object
dtypes: int64(3), object(2)
memory usage: 779.8+ MB

In [6]:
# Vérifier s'il y a des valeurs en double
activity.duplicated().sum()

1105

In [7]:
# Vérifier s'il y a des valeurs manquantes
activity.isnull().sum()

EntityNumber      0
ActivityGroup     0
NaceVersion       0
NaceCode          0
Classification    0
dtype: int64

### address.csv

In [8]:
dtype_dict = {
    2: 'str',
    3: 'str',
    4: 'str'
}
address = pd.read_csv('../data/address.csv', dtype=dtype_dict, low_memory=False)

In [9]:
address.head()

,EntityNumber,TypeOfAddress,CountryNL,CountryFR,Zipcode,MunicipalityNL,MunicipalityFR,StreetNL,StreetFR,HouseNumber,Box,ExtraAddressInfo,DateStrikingOff
0,0200.065.765,REGO,NaN,NaN,9070,Destelbergen,Destelbergen,Panhuisstraat,Panhuisstraat,1,NaN,NaN,NaN
1,0200.068.636,REGO,NaN,NaN,9000,Gent,Gent,Stropstraat,Stropstraat,1,NaN,NaN,NaN
2,0200.171.970,REGO,NaN,NaN,9000,Gent,Gent,Brabantdam,Brabantdam,101,NaN,NaN,NaN
3,0200.245.711,REGO,NaN,NaN,9500,Geraardsbergen,Geraardsbergen,Hoge Buizemont,Hoge Buizemont,247,NaN,NaN,NaN
4,0200.305.493,REGO,NaN,NaN,9520,Sint-Lievens-Houtem,Sint-Lievens-Houtem,Gentsesteenweg,Gentsesteenweg,1B,NaN,NaN,NaN

In [10]:
address.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2765156 entries, 0 to 2765155
Data columns (total 13 columns):
 #   Column            Dtype
---  ------            -----
 0   EntityNumber      object
 1   TypeOfAddress     object
 2   CountryNL         object
 3   CountryFR         object
 4   Zipcode           object
 5   MunicipalityNL    object
 6   MunicipalityFR    object
 7   StreetNL          object
 8   StreetFR          object
 9   HouseNumber       object
 10  Box               object
 11  ExtraAddressInfo  object
 12  DateStrikingOff   object
dtypes: object(13)
memory usage: 274.3+ MB

In [11]:
address.duplicated().sum()

0

In [12]:
address.isnull().sum()

EntityNumber              0
TypeOfAddress             0
CountryNL           2683139
CountryFR           2683139
Zipcode               10999
MunicipalityNL          150
MunicipalityFR          150
StreetNL               8539
StreetFR               8539
HouseNumber           15266
Box                 2381990
ExtraAddressInfo    2738123
DateStrikingOff     2732801
dtype: int64

### branch.csv

In [13]:
branch = pd.read_csv('../data/branch.csv')

In [14]:
branch.head()

              Id   StartDate EnterpriseNumber
0  9.000.006.626  01-09-1995     0257.883.408
1  9.000.008.210  01-01-1968     0400.051.358
2  9.000.008.705  01-01-1968     0400.067.095
3  9.000.009.594  01-01-1968     0400.150.140
4  9.000.011.574  30-04-1963     0400.291.680

In [15]:
branch.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7355 entries, 0 to 7354
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Id                7355 non-null   object
 1   StartDate         7355 non-null   object
 2   EnterpriseNumber  7355 non-null   object
dtypes: object(3)
memory usage: 172.5+ KB

In [16]:
branch.duplicated().sum()

0

In [17]:
branch.isnull().sum()

Id                  0
StartDate           0
EnterpriseNumber    0
dtype: int64

### code.csv

In [18]:
code = pd.read_csv('../data/code.csv')

In [19]:
code.head()

        Category Code Language        Description
0  ActivityGroup  001       FR      Activités TVA
1  ActivityGroup  001       NL   BTW-activiteiten
2  ActivityGroup  002       FR     Activités EDRL
3  ActivityGroup  002       NL  EDRL-activiteiten
4  ActivityGroup  003       FR          Activités

In [20]:
code.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14948 entries, 0 to 14947
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Category     14948 non-null  object
 1   Code         14948 non-null  object
 2   Language     14948 non-null  object
 3   Description  14948 non-null  object
dtypes: object(4)
memory usage: 467.3+ KB

In [21]:
code.duplicated().sum()

0

In [22]:
code.isnull().sum()

Category       0
Code           0
Language       0
Description    0
dtype: int64

### contact.csv

In [23]:
contact = pd.read_csv('../data/contact.csv')

In [24]:
contact.head()

   EntityNumber EntityContact ContactType                       Value
0  0200.362.210           ENT       EMAIL    officiel.ic-inbw@inbw.be
1  0200.362.408           ENT         TEL                02 315 13 51
2  0200.362.408           ENT       EMAIL                info@isbw.be
3  0201.105.843           ENT       EMAIL    officiel.ic-idea@idea.be
4  0201.107.922           ENT       EMAIL  officiel.ic-irsia@irsia.be

In [25]:
contact.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 648723 entries, 0 to 648722
Data columns (total 4 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   EntityNumber   648723 non-null  object
 1   EntityContact  648723 non-null  object
 2   ContactType    648723 non-null  object
 3   Value          648723 non-null  object
dtypes: object(4)
memory usage: 19.8+ MB

In [26]:
contact.duplicated().sum()

1790

In [27]:
contact.isnull().sum()

EntityNumber     0
EntityContact    0
ContactType      0
Value            0
dtype: int64

### denomination.csv

In [28]:
denomination = pd.read_csv('../data/denomination.csv')

In [29]:
denomination.head()

,EntityNumber,Language,TypeOfDenomination,Denomination
0,0200.065.765,2,1,Intergemeentelijke Vereniging Veneco
1,0200.065.765,2,2,Veneco
2,0200.068.636,2,1,Farys
3,0200.171.970,0,1,Sanatorium-Hospitaal van Lemberge
4,0200.245.711,2,1,Intercommunaal Sanatorium Denderoord

In [30]:
denomination.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3223091 entries, 0 to 3223090
Data columns (total 4 columns):
 #   Column              Dtype
---  ------              -----
 0   EntityNumber        object
 1   Language            int64
 2   TypeOfDenomination  int64
 3   Denomination        object
dtypes: int64(2), object(2)
memory usage: 98.4+ MB

In [31]:
denomination.duplicated().sum()

0

In [32]:
denomination.isnull().sum()

EntityNumber           0
Language               0
TypeOfDenomination     0
Denomination          16
dtype: int64

### enterprise.csv

In [33]:
enterprise = pd.read_csv('../data/enterprise.csv')

In [34]:
enterprise.head()

,EnterpriseNumber,Status,JuridicalSituation,TypeOfEnterprise,JuridicalForm,JuridicalFormCAC,StartDate
0,0200.065.765,AC,0,2,416.0,NaN,09-08-1960
1,0200.068.636,AC,0,2,417.0,NaN,16-02-1923
2,0200.171.970,AC,0,2,116.0,NaN,01-01-1968
3,0200.245.711,AC,12,2,116.0,NaN,01-01-1922
4,0200.305.493,AC,0,2,416.0,NaN,19-03-1962

In [35]:
enterprise.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1896421 entries, 0 to 1896420
Data columns (total 7 columns):
 #   Column              Dtype
---  ------              -----
 0   EnterpriseNumber    object
 1   Status              object
 2   JuridicalSituation  int64
 3   TypeOfEnterprise    int64
 4   JuridicalForm       float64
 5   JuridicalFormCAC    float64
 6   StartDate           object
dtypes: float64(2), int64(2), object(3)
memory usage: 101.3+ MB

In [36]:
enterprise.duplicated().sum()

0

In [37]:
enterprise.isnull().sum()

EnterpriseNumber            0
Status                      0
JuridicalSituation          0
TypeOfEnterprise            0
JuridicalForm          771265
JuridicalFormCAC      1767260
StartDate                   0
dtype: int64

### establishment.csv

In [38]:
establishment = pd.read_csv('../data/establishment.csv')

In [39]:
establishment.head()

  EstablishmentNumber   StartDate EnterpriseNumber
0       2.000.000.339  01-11-1974     0403.449.823
1       2.000.000.438  01-09-1964     0403.590.274
2       2.000.001.032  17-01-1967     0403.174.758
3       2.000.002.022  01-04-1963     0401.729.854
4       2.000.003.606  01-07-1964     0403.813.275

In [40]:
establishment.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1632645 entries, 0 to 1632644
Data columns (total 3 columns):
 #   Column               Non-Null Count    Dtype
---  ------               --------------    -----
 0   EstablishmentNumber  1632645 non-null  object
 1   StartDate            1632645 non-null  object
 2   EnterpriseNumber     1632645 non-null  object
dtypes: object(3)
memory usage: 37.4+ MB

In [41]:
establishment.duplicated().sum()

0

In [42]:
establishment.isnull().sum()

EstablishmentNumber    0
StartDate              0
EnterpriseNumber       0
dtype: int64

## Analyse des données

### activity.csv

- 20.443.184 rows
- 1.105 duplicates
- EntityNumber: 2.868.926 unique values
- ActivityGroup: 1,3,4,5,6,7
- NaceVersion: 2003,2008
- NaceCode: 5.302 unique values
- Classification: MAIN,SECO,ANCI

### address.csv

- 2.765.156 rows
- EntityNumber: all unique
- TypeOfAddress: BAET,REGO,ABBR
- CountryNL, CountryFR: 
    - 97% empty
    - ~210 unique values
- Zipcode: 
    - 10.999 empty (<1%)
- MunicipalityNL, MunicipalityFR: 
    - <1% empty
    - ~28.400 unique values
- StreetNL, StreetFR:
    - <1% empty
    - ~155.000 unique values
- HouseNumber: 
    - <1% empty
    - 28.221 unique values
- Box:
    - 86% empty
    - 11.500 unique values
    - random strings
- ExtraAddressInfo:
    - \>99% empty
    - 20.000 unique values
- DateStrikingOff:
    - 99% empty
    - 3.648 unique values

### branch.csv

- 7.355 rows
- Id: all unique
- StartDate
- EnterpriseNumber

### code.csv

- 14.948 rows
- Category: 13 unique values
- Code: 6.788 unique values
- Language: FR,NL,DE
- Description

### contact.csv

- 648.723 rows
- 1.790 duplicates
- EntityNumber: 390.391 unique values
- EntityContact: ENT,EST
- ContactType: EMAIL,TEL,WEB
- Value: 520.887 unique values

### denomination.csv

- 3.223.091 rows
- EntityNumber: 96% unique
- Language: 0,1,2,3,4
- TypeOfDenomination: 1,2,3,4
- Denomination:
    - \<1% empty
    - 79% unique values

### enterprise.csv

- 1.896.421 rows
- EnterpriseNumber: all unique
- Status: 100% AC
- JuridicalSituation:
    - 90% 0
    - 18 unique values
- TypeOfEntreprise: 1,2
- JuridicalForm:
    - 41% empty
    - 105 unique values
- JuridicalFormCAC:
    - 93% empty
    - 5 unique values
- StartDate: 30.000 unique values

### establishment.csv

- 1.632.645 rows
- EstablishmentNumber: all unique
- StartDate: 19.455 unique values
- EnterpriseNumber: 90% unique values

In [43]:
# list distinct values in the column
code['Category'].unique()

array(['ActivityGroup', 'Classification', 'ContactType', 'EntityContact',
       'JuridicalForm', 'JuridicalSituation', 'Language', 'Nace2003',
       'Nace2008', 'Status', 'TypeOfAddress', 'TypeOfDenomination',
       'TypeOfEnterprise'], dtype=object)